Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32_master/src/Main.cpp
        }
      }

      int pedal_config_IDX=0;
      for(pedal_config_IDX=0;pedal_config_IDX<3;pedal_config_IDX++)
      {
        if(ESPNow_request_config_b[pedal_config_IDX])
        {
          DAP_config_st * dap_config_st_local_ptr;
          DAP_config_st dap_config_st_local;
          if(pedal_config_IDX==0)
          {
            memcpy(&dap_config_st_local, &dap_config_st_Clu, sizeof(DAP_config_st));
            //dap_config_st_local_ptr = &dap_config_st_Clu;
          }
          if(pedal_config_IDX==1)
          {
            memcpy(&dap_config_st_local, &dap_config_st_Brk, sizeof(DAP_config_st));
            //dap_config_st_local_ptr = &dap_config_st_Brk;
          }
          if(pedal_config_IDX==2)
          {
            memcpy(&dap_config_st_local, &dap_config_st_Gas, sizeof(DAP_config_st));
            //dap_config_st_local_ptr = &dap_config_st_Gas;
          }
          dap_config_st_local_ptr= &dap_config_st_local;
          
          //uint16_t crc = checksumCalculator((uint8_t*)(&(dap_config_st.payLoadHeader_)), sizeof(dap_config_st.payLoadHeader_) + sizeof(dap_config_st.payLoadPedalConfig_));
          crc = checksumCalculator((uint8_t*)(&(dap_config_st_local.payLoadHeader_)), sizeof(dap_config_st_local.payLoadHeader_) + sizeof(dap_config_st_local.payLoadPedalConfig_));
          //dap_config_st_local_ptr->payloadFooter_.checkSum = crc;
          dap_config_st_local_ptr->payLoadHeader_.PedalTag=dap_config_st_local_ptr->payLoadPedalConfig_.pedal_type;
          Serial.write((char*)dap_config_st_local_ptr, sizeof(DAP_config_st));
          Serial.print("\r\n");
          ESPNow_request_config_b[pedal_config_IDX]=false;
          Serial.print("[L]Pedal:");
          Serial.print(pedal_config_IDX);
          Serial.println("config returned");
          delay(3);
        }
      }


      if(basic_rssi_update)//Bridge action
      {
        //fill header and footer
        dap_bridge_state_st.payLoadHeader_.startOfFrame0_u8 = SOF_BYTE_0;
        dap_bridge_state_st.payLoadHeader_.startOfFrame1_u8 = SOF_BYTE_1;
        dap_bridge_state_st.payloadFooter_.enfOfFrame0_u8 = EOF_BYTE_0;
        dap_bridge_state_st.payloadFooter_.enfOfFrame1_u8 = EOF_BYTE_1;
        int rssi_filter_value=constrain(rssi_filter.process(rssi_display),-100,0) ;
        dap_bridge_state_st.payloadBridgeState_.Pedal_RSSI=(uint8_t)(rssi_filter_value+101);
        dap_bridge_state_st.payLoadHeader_.PedalTag=5; //5 means bridge
        dap_bridge_state_st.payLoadHeader_.payloadType=DAP_PAYLOAD_TYPE_BRIDGE_STATE;
        dap_bridge_state_st.payLoadHeader_.version=DAP_VERSION_CONFIG;
        dap_bridge_state_st.payloadBridgeState_.Bridge_action=0;
        memcpy(dap_bridge_state_st.payloadBridgeState_.Pedal_RSSI_Realtime,rssi,sizeof(int32_t)*3);
        //parse_version(BRIDGE_FIRMWARE_VERSION,&dap_bridge_state_st.payloadBridgeState_.Bridge_firmware_version_u8[0],&dap_bridge_state_st.payloadBridgeState_.Bridge_firmware_version_u8[1],&dap_bridge_state_st.payloadBridgeState_.Bridge_firmware_version_u8[2]);
        dap_bridge_state_st.payloadBridgeState_.Bridge_firmware_version_u8[0]=versionMajor;
        dap_bridge_state_st.payloadBridgeState_.Bridge_firmware_version_u8[1]=versionMinor;
        dap_bridge_state_st.payloadBridgeState_.Bridge_firmware_version_u8[2]=versionPatch;
        //CRC check should be in the final
        crc = checksumCalculator((uint8_t*)(&(dap_bridge_state_st.payLoadHeader_)), sizeof(dap_bridge_state_st.payLoadHeader_) + sizeof(dap_bridge_state_st.payloadBridgeState_));
        dap_bridge_state_st.payloadFooter_.checkSum=crc;
        DAP_bridge_state_st * dap_bridge_st_local_ptr;
        dap_bridge_st_local_ptr = &dap_bridge_state_st;
        Serial.write((char*)dap_bridge_st_local_ptr, sizeof(DAP_bridge_state_st));
        Serial.print("\r\n");
        basic_rssi_update=false;
        /*
        if(rssi_filter_value<-88)
        {
          Serial.println("Warning: BAD WIRELESS CONNECTION");
          //Serial.print("Pedal:");
          //Serial.print(dap_state_basic_st.payLoadHeader_.PedalTag);
          Serial.print(" RSSI:");
          Serial.println(rssi_filter_value);  
        }
        */
        #ifdef ESPNow_debug
            Serial.print("Pedal:");
            Serial.print(dap_state_basic_st.payLoadHeader_.PedalTag);
            Serial.print(" RSSI:");
            Serial.println(rssi_filter_value);
        #endif
      }
        #ifdef External_RP2040
        if(UARTJoystickUpdate_b)
        {
          DAP_JoystickUART_State * dap_joystickUART_state_local_ptr;
          UARTJoystickUpdate_b=false;
          dap_joystickUART_state_lcl._payloadjoystick.payloadtype=(uint8_t)DAP_PAYLOAD_TYPE_JOYSTICKUART;
          dap_joystickUART_state_lcl._payloadjoystick.key = DAP_JOY_KEY;
          dap_joystickUART_state_lcl._payloadjoystick.DAP_JOY_Version = DAP_JOY_VERSION;
          for(int i=0; i<3;i++)
          {
            dap_joystickUART_state_lcl._payloadjoystick.controllerValue_i32[i]=Joystick_value_original[i];
            dap_joystickUART_state_lcl._payloadjoystick.pedalAvailability[i] = dap_bridge_state_st.payloadBridgeState_.Pedal_availability[i];
          }
          dap_joystickUART_state_lcl._payloadjoystick.pedal_status=pedal_status;
          dap_joystickUART_state_lcl._payloadfooter.checkSum= checksumCalculator((uint8_t*)(&(dap_joystickUART_state_lcl._payloadjoystick)), sizeof(dap_joystickUART_state_lcl._payloadjoystick));
          _rp2040picoUART->UARTSendPacket((uint8_t*)&dap_joystickUART_state_lcl, sizeof(DAP_JoystickUART_State));
          if(dap_joystickUART_state_lcl._payloadjoystick.JoystickAction!=0)
          {
            dap_joystickUART_state_lcl._payloadjoystick.JoystickAction=0;
          }

        }
        #endif

      uint8_t pedalIDX;
      for(pedalIDX=0;pedalIDX<3;pedalIDX++)
      {
        unsigned long current_time=millis();
        if(dap_bridge_state_st.payloadBridgeState_.Pedal_availability[pedalIDX]==1)
        {
          if(current_time-pedal_last_update[pedalIDX]>3000)
          {
            Serial.print("[L]Pedal:");
            Serial.print(pedalIDX);
            Serial.println(" Disconnected");
            dap_bridge_state_st.payloadBridgeState_.Pedal_availability[pedalIDX]=0;

